friend0/pic24/RC_Servo.c
/*
 * File:   RC_Servo.c
 * Author: Gabriel Hugh Elkaim
 *
 * Created on August 14, 2013, 9:51 AM
 */

/******************************************************************************
 * Software License Agreement
 *
 * Copyright � 2011 Microchip Technology Inc.  All rights reserved.
 * Microchip licenses to you the right to use, modify, copy and distribute
 * Software only when embedded on a Microchip microcontroller or digital
 * signal controller, which is integrated into your product or third party
 * product (pursuant to the sublicense terms in the accompanying license
 * agreement).
 *
 * You should refer to the license agreement accompanying this Software
 * for additional information regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED ìAS ISî WITHOUT WARRANTY OF ANY
 * KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY
 * OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR
 * PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION,
 * BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT
 * DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL,
 * INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA,
 * COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY
 * CLAIMS BY THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF),
 * OR OTHER SIMILAR COSTS.
 *
 *****************************************************************************/


#include <xc.h>
#include <plib.h>
#include <peripheral/int.h>
#include <BOARD.h>
#include "RC_Servo.h"
#include <SERIAL.h>


/*******************************************************************************
 * PRIVATE #DEFINES                                                            *
 ******************************************************************************/

//#define RC_DEBUG_VERBOSE
#ifdef RC_DEBUG_VERBOSE
#define dbprintf(...) printf(__VA_ARGS__)
#else
#define dbprintf(...)
#endif
// uncomment if ok with short pulse when shutting down module
//#define SHUTDOWN_WITH_SHORT_PULSE_OK

#ifdef RC_SERVO_TEST
#define TEST_LED    LATFbits.LATF6
#define TIMER_LED   LATGbits.LATG6
#endif

#define RCPINCOUNT      10
#define SERVOCENTER     1500
#define RCPERIODTIME    (RCPINCOUNT * MAXPULSE)
#define FULLOVERFLOW    0xFFFF

#define RC_TRISX03  TRISFbits.TRISF5
#define RC_LATX03   LATFbits.LATF5
#define RC_TRISX04  TRISBbits.TRISB0
#define RC_LATX04   LATBbits.LATB0

#define RC_TRISY06  TRISDbits.TRISD10
#define RC_LATY06   LATDbits.LATD10
#define RC_TRISY07  TRISEbits.TRISE7
#define RC_LATY07   LATEbits.LATE7

#define RC_TRISZ08  TRISDbits.TRISD8
#define RC_LATZ08   LATDbits.LATD8
#define RC_TRISZ09  TRISEbits.TRISE1
#define RC_LATZ09   LATEbits.LATE1

#define RC_TRISV03  TRISBbits.TRISB2
#define RC_LATV03   LATBbits.LATB2
#define RC_TRISV04  TRISBbits.TRISB3
#define RC_LATV04   LATBbits.LATB3

#define RC_TRISW07  TRISBbits.TRISB15
#define RC_LATW07   LATBbits.LATB15
#define RC_TRISW08  TRISBbits.TRISB14
#define RC_LATW08   LATBbits.LATB14

/* Note that you need to set the prescalar and periferal clock appropriate to
 * the processor board that you are using. In order to calculate the minimal
 * prescalar: Prescalar = (2000*F_PB/(1000000*0xFFFF))+1, round down */

#define F_PB        (BOARD_GetPBClock())
#define F_PB_IN_KHZ (F_PB/1000)
#define PRESCALE    2
#define uSEC        (F_PB_IN_KHZ / (PRESCALE * 1000))
#define ALLRCPINS   0x3FF

/* Code readability Macros, information hiding */
#define RC_SetOutput(pin)   *RC_TRISCLR[pin] = rcBitsMap[pin]
#define RC_SetInput(pin)    *RC_TRISSET[pin] = rcBitsMap[pin]

#define RC_SetPin(pin)      *RC_LATSET[pin] = rcBitsMap[pin]
#define RC_ClearPin(pin)    *RC_LATCLR[pin] = rcBitsMap[pin]
#define RC_SetPeriod(pin)   WritePeriod4(ReadTimer4() + uSEC * RCupTime[pin])
#define RC_GetTime(pin)     RCupTime[pin]

/*******************************************************************************
 * PRIVATE VARIABLES                                                           *
 ******************************************************************************/
static volatile unsigned int * const RC_TRISCLR[] = {&TRISFCLR, &TRISBCLR, &TRISDCLR,
    &TRISECLR, &TRISDCLR, &TRISECLR,
    &TRISBCLR, &TRISBCLR, &TRISBCLR,
    &TRISBCLR};

static volatile unsigned int * const RC_TRISSET[] = {&TRISFSET, &TRISBSET, &TRISDSET,
    &TRISESET, &TRISDSET, &TRISESET,
    &TRISBSET, &TRISBSET, &TRISBSET,
    &TRISBSET};

static volatile unsigned int * const RC_LATSET[] = {&LATFSET, &LATBSET, &LATDSET,
    &LATESET, &LATDSET, &LATESET,
    &LATBSET, &LATBSET, &LATBSET,
    &LATBSET};
static volatile unsigned int * const RC_LATCLR[] = {&LATFCLR, &LATBCLR, &LATDCLR,
    &LATECLR, &LATDCLR, &LATECLR,
    &LATBCLR, &LATBCLR, &LATBCLR,
    &LATBCLR};
static unsigned short int rcBitsMap[] = {BIT_5, BIT_0, BIT_10, BIT_7, BIT_8,
    BIT_1, BIT_2, BIT_3, BIT_15, BIT_14};

unsigned char RCenabled = FALSE;

static enum {
    none, pulsing, idling
} RCstate = none;

static short int RCupTime[RCPINCOUNT];
static short int RCpinsActive = 0x0000;
static char numRCPins = 0;
static int uSecondsLeftToGo = RCPERIODTIME;
static volatile unsigned short int pinsToAdd = 0x0000;
static volatile unsigned short int pinsToRemove = 0x0000;

/*******************************************************************************
 * PRIVATE FUNCTIONS PROTOTYPES                                                *
 ******************************************************************************/

void RC_InstallPins(void);
void RC_DeletePins(void);
void RC_ShutDown(void);

/*******************************************************************************
 * PUBLIC FUNCTIONS                                                           *
 ******************************************************************************/

/**
 * @Function RC_Init(void)
 * @param none
 * @return SUCCESS or ERROR
 * @brief Initialize the RC module for use. Uses TIMER4 hardware and initializes
 *        the interrupt to occur every 50msec (20Hz)
 * @note Returns FAILURE if called and the module was already enabled.
 * @author Gabriel Hugh Elkaim, 2011.12.15 16:42 */
char RC_Init(void)
{
    char i;
    if (RCenabled) { // Error, initializing an already active module
        dbprintf("\nRC_Servo: ERROR - initialized already active module");
        return ERROR;
    }
    // Initialize the upTime array to all zeros
    for (i = 0; i < RCPINCOUNT; i++) {
        RCupTime[i] = 0;
    }
    // Set up Timer #4 to overflow at more than 2msec, enable and set interrupt
    OpenTimer4(T4_ON | T4_IDLE_STOP | T4_GATE_OFF | T4_PS_1_2 |
        T4_32BIT_MODE_OFF | T4_SOURCE_INT, SERVOCENTER * uSEC);
    // Initialize the interrupt module
    INTClearFlag(INT_T4);
    INTSetVectorPriority(INT_TIMER_4_VECTOR, 4);
    INTSetVectorSubPriority(INT_TIMER_4_VECTOR, 0);
    INTEnable(INT_T4, INT_ENABLED);

    // Module is initialized
    dbprintf("\nRC_Servo: module initialized");
    RCenabled = TRUE;
    RCstate = none;
    return SUCCESS;
}

/**
 * @Function RC_AddPins(unsigned short int RCpins)
 * @param RCpins, use #defined RC_PORTxxx OR'd together for each RC servo pin
 * @return SUCCESS or ERROR
 * @brief Enables an RC servo pin such that it will start the PWM on the
 *        next rollover of TIMER4 (20msec max). Will return ERROR if
 *        the pin is already enabled, or if RCpins is out of range. Input
 *        is set by bitwise ORing RC_PORTxYY of desired pins with each
 *        other: ie, RC_AddPins(RC_PORTX03 | RC_PORTZ09);
 * @note If no time has been set, servo will center (1500uSec)
 * @author Gabriel Hugh Elkaim, 2013.07.24 12:25 */
char RC_AddPins(unsigned short int RCpins)
{
    dbprintf("\nRC_Servo: adding pins...");
    // Check if inputs are in range, or if not yet initialized
    if ((RCpins == 0x000) || (RCpins > ALLRCPINS) || (!RCenabled)) {
        // error state, either module or pins not active, or out of range
        dbprintf("\nRC_Servo: add pin FAILED, input out of range or module not initialized");
        return ERROR;
    }
    if ((RCpins & RCpinsActive) || (RCpins & pinsToAdd)) {
        // error, adding already enabled pin (2nd call to add with same args)
        dbprintf("\nRC_Servo: add pin FAILED, pin already enabled");
        return ERROR;
    }
    pinsToAdd |= RCpins;
    return SUCCESS;
}

/**
 * @Function RC_RemovePins(unsigned short int RCpins)
 * @param RCpins - use #defined RC_PORTxxx OR'd together for each RC servo pin
 * @return SUCCESS or ERROR
 * @brief Disables a currently active RC servo pin such that it will shut-
 *        down on the next rollover of TIMER4 (20msec max). Function will
 *        return ERROR if the pin is already disabled, if RCpins is out of
 *        range, or if the RC module is not enabled. Input is set by bitwise
 *        ORing RC_PORTxYY of desired pins with each other: ie,
 *        RC_RemovePins(RC_PORTX03 | RC_PORTZ09);
 * @note Function will leave upTime for pin untouched, such that Removing
 *       and re-Adding a pin will not change the servo position.
 * @author Gabriel Hugh Elkaim, 2013.07.24 12:25 */
char RC_RemovePins(unsigned short int RCpins)
{
    dbprintf("\nRC_Servo: removing pins...");
    // Check if inputs are in range, or if not yet initialized
    if ((RCpins == 0x000) || (RCpins > ALLRCPINS) || (!RCenabled)) {
        // error state, either module or pins not active, or out of range
        dbprintf("\nRC_Servo: remove pin FAILED, input out of range or module not initialized");
        return ERROR;
    }
    if (!((RCpins & RCpinsActive) || (RCpins & pinsToRemove))) {
        // error, removing already disabled pin (2nd call to remove with same args)
        dbprintf("\nRC_Servo: remove pin FAILED, pin already disabled");
        return ERROR;
    }
    pinsToRemove |= RCpins;
    return SUCCESS;

