friend0/pic24/RC_Servo.c
}

/**
 * @Function RC_ListPins(void)
 * @param none
 * @return RCpins - the mask of the pins that are currently active
 * @brief Returns a short with a 1 in each bit for each of the RC_PORTxxx that
 *        is enabled. Returns 0x0000 if no pins are enabled.
 * @note To verify RC_PORTxxx is enabled, test (RC_PORTxxx && RcListPins()), if
 *       the result is FALSE, then the pin is currently disabled.
 * @author Gabriel Hugh Elkaim, 2013.07.25 16:05 */
unsigned short int RC_ListPins(void)
{
    return (RCpinsActive);
}

/**
 * @Function RcSetPulseTime(unsigned short int RCpin, unsigned short int pulseTime)
 * @param RCpin - use #defined RC_PORTxxx (only one)
 * @param pulseTime - pulse width in uSeconds from [1000 to 2000]
 * @return SUCCESS or ERROR
 * @brief Sets the up time of the corresponding RC_PORTxxx pin to the value
 *        in pulseTime in uSec [1000 to 2000 nominally]. Checks for valid
 *        inputs for RCpin and ranges for pulseTime. Returns ERROR if the
 *        pin is not currently active.
 * @author Gabriel Hugh Elkaim, 2011.12.15 16:42 */
char RC_SetPulseTime(unsigned short int RCpin, unsigned short int pulseTime)
{
    char i;
    if ((pulseTime < MINPULSE) || (pulseTime > MAXPULSE)) {
        // error state, input out of range
        dbprintf("\nRC_Servo: Set Pulse FAILED, pulse time out of range");
        return ERROR;
    }
    if ((RCpin == 0x000) || (RCpin > ALLRCPINS) || (!RCenabled)) {
        // error state, either module or pins not active, or out of range
        dbprintf("\nRC_Servo: Set Pulse FAILED, out of bounds or module inactive");
        return ERROR;
    }
    // check if pin currently active, either it is already active or pending
    if ((RCpin & RCpinsActive) || (RCpin & pinsToAdd)) {
        i = 0;
        while (RCpin > 1) { // find position of 1 in RCpin
            RCpin >>= 1;
            i++;
        }
        dbprintf("\nRC_Servo: Set Pulse for pin %d at %d uSec", i, pulseTime);
        RCupTime[i] = pulseTime;
        return SUCCESS;
    }
    // error state, pin not active
    dbprintf("\nRC_Servo: Set Pulse FAILED, pin inactive");
    return ERROR;
}

/**
 * @Function RcGetPulseTime(unsigned short int RCpin)
 * @param RCpin - use #defined RC_PORTxxx (only one)
 * @return pulseTime - Pulse width in uSeconds
 * @brief  Returns the current value of the pulse width for the corresponding
 *         RC_PORTxxx pin. Checks for valid input range for RCpin and returns
 *         ERROR if input out of range.
 * @author Gabriel Hugh Elkaim, 2011.12.15 16:42 */
short int RC_GetPulseTime(unsigned short int RCpin)
{
    char i;
    if (!RCenabled) { // fails, module not enabled
        dbprintf("\nRC_Servo: Get Pulse FAILED, module not enabled");
        return ERROR;
    }
    if ((RCpin == 0x000) || (RCpin > ALLRCPINS)) { // fails, pin out of range
        dbprintf("\nRC_Servo: Get Pulse FAILED, pin out of range");
        return ERROR;
    }
    i = 0;
    while (RCpin > 1) { // find position of 1 in RCpin
        RCpin >>= 1;
        i++;
    }
    return (RCupTime[i]);
}

/**
 * @Function RC_ChangePending(void)
 * @param none
 * @return TRUE or FALSE
 * @brief Returns TRUE if pending RC pin changes (Add or Remove) are
 *        still pending, FALSE otherwise.
 * @author Gabriel Hugh Elkaim, 2013.08.18 21:56 */
char RC_ChangePending(void)
{
    // check if either module variable has pending operations
    if ((pinsToAdd == 0) && (pinsToRemove == 0)) {
        return FALSE;
    }
    return TRUE;
}

/**
 * @Function RcEnd(void)
 * @param none
 * @return SUCCESS or ERROR
 * @brief Shuts down the RC_SERVO module. Sets flag so that TIMER4 will
 *        turn off all pins once the idle state of the timer is reached.
 *        All enabled RC_PORTxxx pins that are enabled will be turned into
 *        digital inputs.
 * @author Gabriel Hugh Elkaim, 2011.12.15 16:42 */
char RC_End(void)
{
    if (!RCenabled) {
        // error state, module not active
        dbprintf("\nRC_SERVO: end FAILED, module already shut down");
        return ERROR;
    }
    // note that all shutdown will actually occur in T4 ISR routine on the next
    // T4 rollover unless SHUTDOWN_WITH_SHORT_PULSE is defined, in which case
    // it will happen immediately.
    RCenabled = FALSE;

#ifdef SHUTDOWN_WITH_SHORT_PULSE_OK
    RC_ShutDown();
#endif
    return SUCCESS;
}

/*******************************************************************************
 * PRIVATE FUNCTIONS                                                           *
 ******************************************************************************/

/**
 * @Function RC_InstallPins(void) -- PRIVATE FUNCTION
 * @param none
 * @return none
 * @brief Goes through pinToAdd and sets pins as outputs, clears pins, and
 *        sets the servo to centered if not previously used. Inserts pins
 *        into RCpinsActive.
 * @author Gabriel Hugh Elkaim, 2013.08.16, 23:26 */
void RC_InstallPins(void)
{
    char i;
    unsigned short curPin;
    if (pinsToAdd) { // there are new pins to add
        // Go through input and set each RC pin direction and force to low
        for (i = 0; i < RCPINCOUNT; i++) {
            curPin = (1 << i);
            if (pinsToAdd & curPin) {
                numRCPins++;
                if (RCupTime[i] == 0) {
                    RCupTime[i] = SERVOCENTER;
                }
                RC_SetOutput(i); // Sets pin direction to output
                RC_ClearPin(i); // Forces pin to low state
                dbprintf("\nEnabling pin: 0x%X", curPin);
            }
        }
        RCpinsActive |= pinsToAdd;
        pinsToAdd = 0x000;
    }
}

/**
 * @Function RC_DeletePins(void) -- PRIVATE FUNCTION
 * @param none
 * @return none
 * @brief Goes through pinToRemove and sets pin as input, clears pin.
 *        Removes pins from RCpinsActive.
 * @author Gabriel Hugh Elkaim, 2013.08.16, 23:26 */
void RC_DeletePins(void)
{
    char i;
    unsigned short curPin;
    if (pinsToRemove) { // there are new pins to remove
        // Go through input and set each RC pin to input and force to low
        for (i = 0; i < RCPINCOUNT; i++) {
            curPin = (1 << i);
            if (pinsToRemove & curPin) {
                numRCPins--;
                RC_ClearPin(i); // Forces pin to low state
                RC_SetInput(i); // Set pin as input
                dbprintf("\nRemoving pin: 0x%X", curPin);
            }
        }
        RCpinsActive &= ~pinsToRemove;
        pinsToRemove = 0;
    }
}

/**
 * @Function RC_ShutDown(void) -- PRIVATE FUNCTION
 * @param none
 * @return none
 * @brief Removes all pins in RCpinsActive, resets the RCupTime array to 0
 *        clears all previously active pins and sets them as inputs. Shuts
 *        down the TIMER4 interrupt.
 * @author Gabriel Hugh Elkaim, 2013.08.16, 23:26 */
void RC_ShutDown(void)
{
    char i;
    if (RCpinsActive) {
        pinsToRemove = RCpinsActive;
        RC_DeletePins();
    }
    numRCPins = 0;
    for (i = 0; i < RCPINCOUNT; i++) {
        RCupTime[i] = 0;
    }
    INTEnable(INT_T4, INT_DISABLED);
}


