friend0/pic24/RC_Servo.c
/*******************************************************************************
 * INTERRUPT SERVICE ROUTINES                                                  *
 ******************************************************************************/

/**
 * @Function Timer4IntHandler -- ISR ROUTINE
 * @param none
 * @return none
 * @brief Implements the RC_Servo state machine through the TIMER4 ISR.
 *        Raises and Lowers the appropriate RC pins, and implements a
 *        countdown to get to the 20msec repetition rate.
 * @note Adding and Removing pins are handled within the idling state, after
 *       all pins have gone through their Pulse. Shutdown also occurs in this
 *       state. Potential for idle state to not have any time left, if all 10
 *       servos are enabled and at their largest value.
 * @author Gabriel Hugh Elkaim, 2013.08.16, 23:26 */
void __ISR(_TIMER_4_VECTOR, ipl4) Timer4IntHandler(void)
{
    static char numPin = 0;
    static unsigned short int curPin = 0x001;
    static char indexPin = 0;
    static char prevPin = -1;
    unsigned short int currentTime;

    INTClearFlag(INT_T4);

    // check for shutdown command, and lower all active pins and set to input
    if (!RCenabled) {
        RC_ShutDown();
        return;
    }

    switch (RCstate) {
    case none:
        // no pins active. Reset for 1.5msec, check for pins to add
        WritePeriod4(ReadTimer4() + uSEC * SERVOCENTER);
        if (pinsToAdd) {
            RC_InstallPins(); // new pins active, reset to start pulses
            curPin = 0x001;
            indexPin = 0;
            numPin = 1;
            RCstate = pulsing;
        }
        break;

    case pulsing:
        // cycle through all active pins, one each interrupt, raising the current
        // and lowering the previous ones until you have done them all
        // Find next pin in RCpinsActive
        while (!(curPin & RCpinsActive)) {
            curPin <<= 1;
            indexPin++;
        }
        uSecondsLeftToGo -= RC_GetTime(indexPin);
        RC_SetPin(indexPin);
        RC_SetPeriod(indexPin);
        if (numPin != 1) { // not on first pin, lower previous pin
            RC_ClearPin(prevPin);
        }
        prevPin = indexPin;
        curPin <<= 1;
        indexPin++;
        numPin++;
        if (numPin > numRCPins) { // finished all pins, go to idle state
            RCstate = idling;

        }
        break;


    case idling:
        // lower previous pin and reset pin counters to keep track of position
        RC_ClearPin(prevPin);
        currentTime = ReadTimer4();

        if (uSecondsLeftToGo <= 0) {
            RCstate = pulsing;
            INTSetFlag(INT_T4);
        } else if ((uSecondsLeftToGo * uSEC + currentTime) < FULLOVERFLOW) {
            WritePeriod4(currentTime + uSEC * uSecondsLeftToGo);
            RCstate = pulsing;
        } else { // need to cycle through
            uSecondsLeftToGo -= MAXPULSE;
            WritePeriod4(currentTime + uSEC * MAXPULSE);
        }

        if (RCstate == pulsing) {// switching back from idle to pulsing
            uSecondsLeftToGo = RCPERIODTIME;
            curPin = 0x001;
            indexPin = 0;
            numPin = 1;
        }

        if (pinsToAdd) RC_InstallPins();
        if (pinsToRemove) RC_DeletePins();
        if (numRCPins == 0) {
            uSecondsLeftToGo = RCPERIODTIME;
            RCstate = none;
        }
        break;

    default:
        dbprintf("\nRC_Servo: ERROR, module in undefined state");
        break;
    }
}



/*******************************************************************************
 * TEST HARNESS                                                                *
 ******************************************************************************/
#ifdef RC_SERVO_TEST

#include <xc.h>
#include <SERIAL.h>
#include "RC_Servo.h"
#include <stdio.h>


#define DELAY(x)    for (wait = 0; wait <= x; wait++) {asm("nop");}
#define FlushPrintBuffer() //while(!IsTransmitEmpty())
#define A_BIT       183000
#define A_LOT       1830000
#define NUM2SWEEP   10
#define NUM2SPIN    2
#define INC         100
#define RC_PORT     RC_PORTX04

int main(void)
{
    unsigned int wait = 0;
    unsigned short int pulse;
    short int returnPulse;
    unsigned short int i, j, k;
    char testPassed = FALSE;
    int8_t wantedResult = SUCCESS;
    DELAY(A_BIT);
    BOARD_Init();
    DELAY(A_LOT);
    printf("\nCMPE118 RC_SERVO module test harness.");
    printf("\nTiming information: PBClock %d (%3.2f Mhz), Counts per uSec: %d",
        F_PB, F_PB_IN_KHZ / 1000.0, uSEC);
    printf("\nInitial Test, ensure all functions return ERROR "
        "before RC_Init() is run\n");


    /***************************************************************************
     *            TEST RC MODULE ERROR CHECKING BEFORE ENABLE                  *
     ***************************************************************************/
    //
    // RC_AddPins() should FAIL before enable
    //
    printf("\nTesting: RC_AddPins() for each pin before enable: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_AddPins(i) == ERROR) {
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        } else {
            testPassed = FALSE;
            printf("\nRC_AddPins(0x%03x) returned SUCCESS: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    //
    // RC_RemovePins() should FAIL before enable
    //
    printf("\nTesting: RC_RemovePins() for each pin before enable: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_RemovePins(i) == ERROR) {

            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        } else {
            testPassed = FALSE;
            printf("\nRC_RemovePins(0x%03x) returned SUCCESS: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    //
    // RC_SetPulseTime() should FAIL before enable
    //
    printf("\nTesting: RC_SetPulseTime() for each pin before enable: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_SetPulseTime(i, SERVOCENTER) == ERROR) {
            DELAY(A_BIT);
        } else {
            testPassed = FALSE;
            printf("\nRC_SetPulseTime(0x%03x) returned SUCCESS "
                "before enable: FAILED TEST", i);
        }
    }
    if (testPassed) printf("PASSED");

    DELAY(A_BIT);
    FlushPrintBuffer();

    //
    // RC_GetPulseTime() should FAIL before enable
    //
    printf("\nTesting: RC_GetPulseTime() for each pin before enable: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_GetPulseTime(i) == ERROR) {
            DELAY(A_BIT);
        } else {
            testPassed = FALSE;
            printf("\nRC_GetPulseTime(0x%03x) returned SUCCESS "
                "before enable: FAILED TEST", i);
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    //
    // RC_ListPins() should return all zeros
    //
    printf("\nTesting: RC_ListPins() before enable: ");
    if (RC_ListPins() == 0x000) {
        printf("PASSED");
    } else {
        printf("FAILED");
        printf("\nRC_ListPins() = 0x%03x, FAILED TEST", RC_ListPins());
    }
    FlushPrintBuffer();

    //
    // RC_End() should FAIL before enable
    //
    printf("\nTesting: RC_End() before enable: ");
    if (RC_End() == ERROR) {
        printf("PASSED");
    } else {
        printf("FAILED TEST");
    }
    printf("\nRC Module tests before RC_Init() complete.\n");
    FlushPrintBuffer();

    /***************************************************************************
     *            ENABLE RC MODULE TEST INIT AND END                           *
     ***************************************************************************/
    //
    //Enable module, test error checking on all functions
    //
    DELAY(A_BIT);
    printf("\nTesting: Enable Module and re-test bounds checking");
    printf("\nEnabling RC module with RC_Init(): ");
    if (RC_Init() == SUCCESS) {
        printf("PASSED");
    } else {
        printf("FAILED TEST");
    }
    DELAY(A_BIT);
    printf("\nRe-enabling RC module with RC_Init(): ");
    if (RC_Init() == SUCCESS) {
        printf("FAILED TEST");
    } else {
        printf("PASSED");
    }
    DELAY(A_BIT);
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_ADDPIN()                                             *
     ***************************************************************************/
    printf("\n\nTesting RC_AddPins() functionality");
    printf("\nTesting: RC_AddPins(0x000) out of bounds: ");
    if (RC_AddPins(0x000) == SUCCESS) {
        printf("FAILED TEST");
    } else {
        printf("PASSED");
    }
    DELAY(A_BIT);
    printf("\nTesting: RC_AddPins(0xFFF), out of bounds: ");
    if (RC_AddPins(0xFFF) == SUCCESS) {
        printf("FAILED TEST");
    } else {
        printf("PASSED");
    }

    DELAY(A_BIT);
    printf("\nTesting: RC_AddPins() for each pin: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_AddPins(i) == SUCCESS) {
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        } else {
            testPassed = FALSE;
            printf("\nRC_AddPins(0x%03x) returned ERROR: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    DELAY(A_BIT);
    printf("\nTesting: RC_AddPins() for each pin already enabled: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_AddPins(i) == ERROR) {
            DELAY(A_BIT);
        } else {
            testPassed = FALSE;
            printf("\nRC_AddPins(0x%03x) returned SUCCESS with pin "
                "already enabled: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    printf("\nTesting RC_ListPins() with all pins enabled: ");
    if (RC_ListPins() == ALLRCPINS) {
        printf("PASSED");
    } else {
        printf("FAILED");
        printf("\nRC_ListPins() = 0x%03x, FAILED TEST", RC_ListPins());
    }
    RC_RemovePins(RC_ListPins()); // get rid of all pins
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    DELAY(A_BIT);
    printf("\nTesting: RC_AddPins() for two pins simultaneously: ");
    testPassed = TRUE;
    for (j = 1; j <= ALLRCPINS; j <<= 1) {
        for (i = 1; i <= ALLRCPINS; i <<= 1) {
            if (RC_AddPins(i | j) == SUCCESS) {
                while (RC_ChangePending()) { // wait until change occured
                    DELAY(A_BIT);
                }
            } else {
                testPassed = FALSE;
                printf("\nRC_AddPins(0x%03x) returned ERROR: TEST FAILED", i | j);
            }
            RC_RemovePins(i | j); // remove currently enabled pins
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        }
    }
    if (testPassed) printf("PASSED");
    printf("\nRC_AddPins() Tests complete.");
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_REMOVEPIN()                                          *
     ***************************************************************************/
    RC_AddPins(ALLRCPINS); // enable all pins for remove pin test
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    printf("\n\nTesting RC_RemovePins() functionality");
    printf("\nTesting: RC_RemovePins(0x000) out of bounds: ");
    if (RC_RemovePins(0x000) == SUCCESS) {
        printf("FAILED TEST");
    } else {
        printf("PASSED");
    }
    DELAY(A_BIT);
    printf("\nTesting: RC_RemovePins(0xFFF), out of bounds: ");
    if (RC_RemovePins(0xFFF) == SUCCESS) {
        printf("FAILED TEST");
    } else {
        printf("PASSED");
    }

    DELAY(A_BIT);
    printf("\nTesting: RC_RemovePins() for each pin: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_RemovePins(i) == SUCCESS) {
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        } else {
            testPassed = FALSE;
            printf("\nRC_RemovePins(0x%03x) returned ERROR: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    DELAY(A_BIT);
    printf("\nTesting: RC_RemovePins() for each pin already disabled: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_RemovePins(i) == ERROR) {
            DELAY(A_BIT);
        } else {
            testPassed = FALSE;
            printf("\nRC_RemovePins(0x%03x) returned SUCCESS with pin "
                "already disabled: TEST FAILED", i);
        }
    }
    if (testPassed) printf("PASSED");
    printf("\nTesting: RC_ListPins() with all pins disabled: ");
    if (RC_ListPins() == 0x000) {
        printf("PASSED");
    } else {
        printf("FAILED");
        printf("\nRC_ListPins() = 0x%03x, FAILED TEST", RC_ListPins());
    }
    printf("\nRC_RemovePins() Tests complete.");
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_LISTPINS()                                            *
     ***************************************************************************/
    printf("\n\nTesting RC_ListPins() functionality");
    DELAY(A_BIT);
    printf("\nTesting: RC_ListPins() for each individual pin: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_AddPins(i);
        while (RC_ChangePending()) { // wait until change occured
            DELAY(A_BIT);
        }
        if (RC_ListPins() != i) {
            testPassed = FALSE;
            printf("\nRC_ListPins() = 0x%03x does not "
                "match [0x%03x]: TEST FAILED", RC_ListPins(), i);
        }
        RC_RemovePins(i);
        while (RC_ChangePending()) { // wait until change occured
            DELAY(A_BIT);
        }
    }
    if (testPassed) printf("PASSED");
    // now do it with all pins active
    printf("\nTesting: RC_ListPins() for aggregate pins: ");
    testPassed = TRUE;
    RC_RemovePins(RC_ListPins()); // get rid of all pins
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    for (i = 1; i <= ALLRCPINS; i = (i << 1) + 1) {
        RC_AddPins(i);
        while (RC_ChangePending()) { // wait until change occured
            DELAY(A_BIT);
        }
        if (RC_ListPins() != i) {
            testPassed = FALSE;
            printf("\nRC_ListPins() = 0x%03x does not "
                "match [0x%03x]: TEST FAILED", RC_ListPins(), i);
        }
        RC_RemovePins(i);
        while (RC_ChangePending()) { // wait until change occured
            DELAY(A_BIT);
        }
    }
    if (testPassed) printf("PASSED");
    // now test for all enabled but one
    printf("\nTesting: RC_ListPins() for all pins except one: ");
    testPassed = TRUE;
    RC_RemovePins(RC_ListPins()); // get rid of all pins
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    RC_AddPins(ALLRCPINS);
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        if (RC_RemovePins(i) == SUCCESS) {
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
            if (RC_ListPins() != (ALLRCPINS & (~i))) {
                testPassed = FALSE;
                printf("\nRC_ListPins() = 0x%03x does not "
                    "match [0x%03x]: TEST FAILED", RC_ListPins(), (ALLRCPINS & (~i)));
            }
            RC_AddPins(i);
            while (RC_ChangePending()) { // wait until change occured
                DELAY(A_BIT);
            }
        }
    }
    if (testPassed) printf("PASSED");
    RC_End();
    DELAY(A_LOT);

    printf("\nRC_ListPins() Tests complete.");
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_SETPULSE()                                            *
     ***************************************************************************/
    RC_Init();
    printf("\n\nTesting RC_SetPulseTime() functionality");
    printf("\nALL pinse set to SERVOCENTER, all attached servos should center");
    RC_AddPins(ALLRCPINS);
    while (RC_ChangePending()) { // wait until change occured
        DELAY(A_BIT);
    }
    if (RC_ListPins() != ALLRCPINS) {
        printf("ERROR, pins not enabled");
    }
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_SetPulseTime(i, SERVOCENTER);
    }
    printf("\n ");
    for (k = 0; k < NUM2SWEEP; k++) {
        DELAY(A_LOT);
        printf(". ");
    }

    printf("\nSweeping pulse on ALL pins from MINPULSE to MAXPULSE (%d times)", NUM2SWEEP);
    printf("\nAny servos attached to pins should move from FULL CCW to FULL CW and back");
    printf("\nOn cycle: ");
    for (k = 0; k < NUM2SWEEP; k++) {
        printf("%d ", k);
        for (pulse = MINPULSE; pulse < MAXPULSE; pulse += INC) {
            for (i = 1; i <= ALLRCPINS; i <<= 1) {
                RC_SetPulseTime(i, pulse);
            }
            DELAY(A_LOT);
        }
        for (pulse = MAXPULSE; pulse >= MINPULSE; pulse -= INC) {
            for (i = 1; i <= ALLRCPINS; i <<= 1) {
                RC_SetPulseTime(i, pulse);
            }
            DELAY(A_LOT);
        }
    }
    printf("\n\nSweeping pulse on EACH pin from MINPULSE to MAXPULSE (%d times)", NUM2SPIN);
    printf("\nAll servos attached should remain centered, each servo "
        "will turn from FULL CCW to FULL CW in turn");
    printf("\nOn Servo: ");
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_SetPulseTime(i, SERVOCENTER);
    }
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        printf("[0x%03x] ", i);
        for (k = 0; k < NUM2SPIN; k++) {
            for (pulse = MINPULSE; pulse <= MAXPULSE; pulse += INC) {
                RC_SetPulseTime(i, pulse);
                DELAY(A_LOT);
            }
            for (pulse = MAXPULSE; pulse <= MINPULSE; pulse -= INC) {
                RC_SetPulseTime(i, pulse);
                DELAY(A_LOT);
            }
        }
        RC_SetPulseTime(i, SERVOCENTER);
    }
    printf("\nRC_SetPulseTime Tests complete");
    FlushPrintBuffer();


    /***************************************************************************
     *            TEST RC_GETPULSE()                                            *
     ***************************************************************************/

    printf("\n\nTesting RC_GetPulseTime() functionality");
    printf("\nTesting: RC_GetPulseTime() for each pin set to SERVOCENTER: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_SetPulseTime(i, SERVOCENTER);
        DELAY(A_BIT);
        pulse = RC_GetPulseTime(i);
        if (pulse != SERVOCENTER) {
            printf("\nRC_GetPulseTime(0x%03X) FAILED: returned %d "
                "instead of %d", i, pulse, SERVOCENTER);
            testPassed = FALSE;
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    printf("\nTesting: RC_GetPulseTime() for each pin set to MINPULSE: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_SetPulseTime(i, MINPULSE);
        pulse = RC_GetPulseTime(i);
        if (pulse != MINPULSE) {
            printf("\nRC_GetPulseTime(0x%03X) FAILED: returned %d "
                "instead of %d", i, pulse, MINPULSE);
            testPassed = FALSE;
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    printf("\nTesting: RC_GetPulseTime() for each pin set to MAXPULSE: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        RC_SetPulseTime(i, MAXPULSE);
        pulse = RC_GetPulseTime(i);
        if (pulse != MAXPULSE) {
            printf("\nRC_GetPulseTime(0x%03X) FAILED: returned %d "
                "instead of %d", i, pulse, MAXPULSE);
            testPassed = FALSE;
        }
    }
    if (testPassed) printf("PASSED");
    FlushPrintBuffer();

    printf("\nTesting: RC_GetPulseTime() for each pin variable value: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        for (pulse = MINPULSE; pulse < MAXPULSE; pulse += INC) {
            RC_SetPulseTime(i, pulse);
            returnPulse = RC_GetPulseTime(i);
            if (returnPulse != pulse) {
                printf("\nRC_GetPulseTime(0x%03X) FAILED: returned %d "
                    "instead of %d", i, returnPulse, pulse);
                testPassed = FALSE;
            }
        }
    }
    if (testPassed) printf("PASSED");
    printf("\nRC_GetPulseTime() Tests complete");
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_CHANGEPENDING()                                      *
     ***************************************************************************/
    printf("\n\nTesting RC_ChangePending() functionality");
    printf("\nTesting: RC_ChangePending() with no change actually pending: ");
    if (RC_ChangePending() == TRUE) printf("FAILED");
    else printf("PASSED");
    printf("\nTesting: RC_ChangePending() from pin deletion: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        INTEnable(INT_T4, INT_DISABLED);
        RC_RemovePins(i);
        if (RC_ChangePending() == FALSE) {
            printf("\nRC_ChangePending() FAILED on pin [0x%03X], returned "
                "FALSE when should be TRUE", i);
            testPassed = FALSE;
        } else {
            INTEnable(INT_T4, INT_ENABLED);
            ;
            while (RC_ChangePending()) {
                DELAY(A_BIT);
            }
        }
    }
    if (testPassed) printf("PASSED");

    printf("\nTesting: RC_ChangePending() from pin addition: ");
    testPassed = TRUE;
    for (i = 1; i <= ALLRCPINS; i <<= 1) {
        INTEnable(INT_T4, INT_DISABLED);
        RC_AddPins(i);
        if (RC_ChangePending() == FALSE) {
            printf("\nRC_ChangePending() FAILED on pin [0x%03X], returned "
                "FALSE when should be TRUE", i);
            testPassed = FALSE;
        } else {
            INTEnable(INT_T4, INT_ENABLED);
            while (RC_ChangePending()) {
                DELAY(A_BIT);
            }
        }
    }
    if (testPassed) printf("PASSED");
    printf("\nRC_ChangePending() Testing complete.");
    FlushPrintBuffer();

    /***************************************************************************
     *            TEST RC_END()                                                *
     ***************************************************************************/
    printf("\nTesting: RC_End() while enabled: ");
    if (RC_End() == SUCCESS) {
        printf("PASSED");
        printf("\nAll enabled pins should be high impedance (inputs)");
    } else {
        printf("FAILED TEST");
    }
    printf("\nRC_End() Testing complete.");
    printf("\n\nRC_SERVO MODULE Testing complete.");
    FlushPrintBuffer();

    while (1) {
        ;
    }
}
#endif


